Revit 2027 API
SpecUtils.IsValidDataType Method
 Returns true if the given ForgeTypeId identifies a valid parameter data type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidDataType(
	ForgeTypeId dataType
)
Public Shared Function IsValidDataType (
	dataType As ForgeTypeId
) As Boolean
public:
static bool IsValidDataType(
	ForgeTypeId^ dataType
)
static member IsValidDataType :
        dataType : ForgeTypeId -> bool
Parameters
dataType ForgeTypeId
 The identifier to check.
Return Value
Boolean
 True if the ForgeTypeId identifies either a spec or a category, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 A ForgeTypeId is acceptable as a parameter data type if it identifies either a spec or a category. When a category identifier is used as a parameter data type, it indicates a Family Type parameter of that category.
See Also
Reference
SpecUtils Class
Autodesk.Revit.DB Namespace